# ExportUtils Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportUtils Class
Members See Also
---
This class provides utilities related to document export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static class ExportUtils
```

Visual Basic
---
```text
Public NotInheritable Class ExportUtils
```

Visual C++
---
```text
public ref class ExportUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExportUtils
# See Also
ExportUtils Members
Autodesk.Revit.DB Namespace